rule = """В этих шахматах действуют те же правила, что и в классических, но есть некоторые условия в формулировке ходов.
Ход осуществляется записью в виде XYZ-XMN, где X-заглавная буква фигуры(пустует у пешки), Y,Z-координаты отправной точки для x,y соответсвенно(строчная буква a-h и цифра 1-8), а M,N-координаты конечной точки для x,y соответсвенно(строчная буква a-h и цифра 1-8). 
ВСЕ БУВКВЫ ЛАТИНСКИЕ.
Рокировка осуществляется записью O-O для правой ладьи и O-O-O для левой ладьи.
Шах или убийство вражеской фигуры специально не обозначается.
Буквы для каждой из фигур:
Пешка - пусто
Король - 'K'(King)
Ладья - 'R'(Rook)
Королева - 'Q'(Queen)
Конь - 'N'(kNight)
Слон - 'B'(Bishop)
Сложность по-умолчанию = 1
"""